# Pandas Library

pandas is a Python package providing fast, flexible, and expressive data structures designed to make working with “relational” or “labeled” data both easy and intuitive. It aims to be the fundamental high-level building block for doing practical, real-world data analysis in Python.

### Install Pandas

If you already have Python, you can install Pandas with:

conda install pandas or pip install pandas

### Import Pandas

In [1]:
import pandas as pd
import numpy as np
print(pd.__version__)

1.4.4

### Series

one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers,
Python objects, etc.). The axis labels are collectively referred to as the index.

In [2]:
## Create Series from numpy Library
series_1 = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'],name='elment-in-series')
series_1

a    1.282648
b   -1.025492
c    0.605611
d    2.213093
e   -0.507672
Name: elment-in-series, dtype: float64

In [3]:
series_1.rename('example_1')

a    1.282648
b   -1.025492
c    0.605611
d    2.213093
e   -0.507672
Name: example_1, dtype: float64

In [4]:
series_1.name

'elment-in-series'

In [5]:
series_1.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [6]:
series_1.values

array([ 1.28264803, -1.02549208,  0.60561079,  2.21309257, -0.50767156])

In [7]:
## Create Series by numpy Library and list
series_2 = pd.Series(np.array([19,4,5,6]),index=['A','B','C','D'])
series_2

A    19
B     4
C     5
D     6
dtype: int32

In [8]:
## Create Series from Python dictionary  without index
d = {'a': 1, 'b': 2, 'c': 3}
series_3 = pd.Series(data=d)
series_3

a    1
b    2
c    3
dtype: int64

In [9]:
## Create Series from Python dictionary  with index
d = {'a': 7, 'b': 0, 'c': 9}
series_4 = pd.Series(data=d,index=['a', 'b', 'c'])
series_4

a    7
b    0
c    9
dtype: int64

In [10]:
t = {'a': 17, 'b': 10, 'c': 11}
series_5 = pd.Series(data=t,index=['x', 'y', 'z'])
series_5

x   NaN
y   NaN
z   NaN
dtype: float64

In [11]:
## Create series from scalar
series_6 = pd.Series(5., index=['a', 'b', 'c', 'd', 'e'])
series_6

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

In [12]:
# insert element to Series
series_6['f']=77.8
series_6

a     5.0
b     5.0
c     5.0
d     5.0
e     5.0
f    77.8
dtype: float64

In [13]:
series_1.dtype

dtype('float64')

In [14]:
series_1.shape

(5,)

In [15]:
series_1.max()

2.213092567303275

In [16]:
series_1.min()

-1.0254920760878363

In [17]:
series_1.mean()

0.5136375486894365

In [18]:
series_1.abs()

a    1.282648
b    1.025492
c    0.605611
d    2.213093
e    0.507672
Name: elment-in-series, dtype: float64

In [19]:
series_1.transpose

<bound method IndexOpsMixin.transpose of a    1.282648
b   -1.025492
c    0.605611
d    2.213093
e   -0.507672
Name: elment-in-series, dtype: float64>

In [20]:
series_1.ndim

1

In [21]:
series_1.unique()

array([ 1.28264803, -1.02549208,  0.60561079,  2.21309257, -0.50767156])

In [22]:
series_1.unique

<bound method Series.unique of a    1.282648
b   -1.025492
c    0.605611
d    2.213093
e   -0.507672
Name: elment-in-series, dtype: float64>

In [23]:
series_1.array

<PandasArray>
[ 1.2826480277517525, -1.0254920760878363,  0.6056107850410716,
   2.213092567303275,  -0.507671560561081]
Length: 5, dtype: float64

In [24]:
## Accesss to element
series_1.get('b')

-1.0254920760878363

In [25]:
series_1.head(1)

a    1.282648
Name: elment-in-series, dtype: float64

In [26]:
series_1.tail(1)

e   -0.507672
Name: elment-in-series, dtype: float64

In [27]:
## delete element in Series
del series_1['a']
series_1

b   -1.025492
c    0.605611
d    2.213093
e   -0.507672
Name: elment-in-series, dtype: float64

### DataFrame

2-dimensional labeled data structure with columns of potentially different types

In [28]:
## Create DataFrame from Python dictionary  without index
d = {"one": [6.0, 2.0, 7.0, 4.0], "two": [14.0, 11.0, 23.0, 21.0] ,"Three":[9.9,7.2,5.,8.]}
dataframe_1 = pd.DataFrame(d)
dataframe_1

   one   two  Three
0  6.0  14.0    9.9
1  2.0  11.0    7.2
2  7.0  23.0    5.0
3  4.0  21.0    8.0

In [29]:
## Create DataFrame from Python dictionary  with index
d = {"one": [6.0, 32.0, 7.0, 42.0], "two": [34.0, 19.0, 23.0, 21.0] ,"Three":[9.9,17.2,5.,81.]}
dataframe_2 = pd.DataFrame(d,index=[1,2,3,4])
dataframe_2

    one   two  Three
1   6.0  34.0    9.9
2  32.0  19.0   17.2
3   7.0  23.0    5.0
4  42.0  21.0   81.0

In [30]:
## Create DataFrame from structured array 
data = np.zeros((2,), dtype=[("A", "i4"), ("B", "f4"), ("C", "a10")])
data[:] = [(1, 2.0, "Hello"), (2, 3.0, "World")]
dataframe_3 = pd.DataFrame(data)
dataframe_3

   A    B         C
0  1  2.0  b'Hello'
1  2  3.0  b'World'

In [31]:
dataframe_4 = pd.DataFrame(data, index=["first", "second"])
dataframe_4

        A    B         C
first   1  2.0  b'Hello'
second  2  3.0  b'World'

In [32]:
dataframe_5 =pd.DataFrame(data, columns=["C", "A", "B"])
dataframe_5

          C  A    B
0  b'Hello'  1  2.0
1  b'World'  2  3.0

In [33]:
## Create DataFrame from dict of tuples
d =  {
        ("a", "b"): {("A", "B"): 1, ("A", "C"): 2},
        ("a", "a"): {("A", "C"): 3, ("A", "B"): 4},
        ("a", "c"): {("A", "B"): 5, ("A", "C"): 6},
        ("b", "a"): {("A", "C"): 7, ("A", "B"): 8},
        ("b", "b"): {("A", "D"): 9, ("A", "B"): 10},
    }
dataframe_6 = pd.DataFrame(d)
dataframe_6

       a              b
       b    a    c    a     b
A B  1.0  4.0  5.0  8.0  10.0
  C  2.0  3.0  6.0  7.0   NaN
  D  NaN  NaN  NaN  NaN   9.0

In [34]:
## Create DataFrame from dict of Series or dicts
d = {
   "one": pd.Series([13.0, 25.0, 93.0], index=["a", "b", "c"]),
   "two": pd.Series([77.0, 29.0, 30.0, 44.0], index=["a", "b", "c", "d"]),
   }
dataframe_7 = pd.DataFrame(d)
dataframe_7

    one   two
a  13.0  77.0
b  25.0  29.0
c  93.0  30.0
d   NaN  44.0

In [35]:
dataframe_8 =  pd.DataFrame(d, index=["d", "b", "a"])
dataframe_8

    one   two
d   NaN  44.0
b  25.0  29.0
a  13.0  77.0

In [36]:
dataframe_9 = pd.DataFrame(d, index=["d", "b", "a"], columns=["two", "three"])
dataframe_9

    two three
d  44.0   NaN
b  29.0   NaN
a  77.0   NaN

In [37]:
## Create DataFrame from list of dicts
data  = [{"a": 1, "b": 2}, {"a": 5, "b": 10, "c": 20}]
dataframe_10 = pd.DataFrame(data)
dataframe_10

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [38]:
## Create DataFrame from Series
series = pd.Series(range(3), index=list("abc"), name="series")
dataframe_11 = pd.DataFrame(series)
dataframe_11

   series
a       0
b       1
c       2

In [39]:
# insert element to Dataframe
d = {
   "one": pd.Series([13.0, 25.0, 93.0], index=["a", "b", "c"]),
   "two": pd.Series([77.0, 29.0, 30.0, 44.0], index=["a", "b", "c", "d"])
   }
dataframe_1 = pd.DataFrame(d)
dataframe_1['one']['a'] = 19
dataframe_1

    one   two
a  19.0  77.0
b  25.0  29.0
c  93.0  30.0
d   NaN  44.0

In [40]:

dataframe_1.insert(2, "three", [99,11,35,65])
dataframe_1

    one   two  three
a  19.0  77.0     99
b  25.0  29.0     11
c  93.0  30.0     35
d   NaN  44.0     65

### Reading data from CSV

In [41]:
# local CSV
CSV_1 = pd.read_csv('titanic.csv', sep=';' , usecols=['PassengerId','Survived', 'Pclass', 'Sex', 'SibSp', 'Parch', 'Age', 'Fare', 'Cabin'])
CSV_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    object
 2   Pclass       891 non-null    int64
 3   Sex          891 non-null    object
 4   Age          714 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Fare         891 non-null    float64
 8   Cabin        204 non-null    object
dtypes: float64(2), int64(4), object(3)
memory usage: 62.8+ KB

In [42]:
CSV_1.dtypes

PassengerId      int64
Survived        object
Pclass           int64
Sex             object
Age            float64
SibSp            int64
Parch            int64
Fare           float64
Cabin           object
dtype: object

In [43]:
CSV_1.head(10)

   PassengerId Survived  Pclass     Sex   Age  SibSp  Parch     Fare  Cabin
0          343       No       2    male  28.0      0      0  13.0000    NaN
1           76       No       3    male  25.0      0      0   7.6500  F G73
2          641       No       3    male  20.0      0      0   7.8542    NaN
3          568       No       3  female  29.0      0      4  21.0750    NaN
4          672       No       1    male  31.0      1      0  52.0000    B71
5          105       No       3    male  37.0      2      0   7.9250    NaN
6          576       No       3    male  19.0      0      0  14.5000    NaN
7          382      Yes       3  female   1.0      0      2  15.7417    NaN
8          228       No       3    male  20.5      0      0   7.2500    NaN
9          433      Yes       2  female  42.0      1      0  26.0000    NaN

In [44]:
CSV_1.tail(10)

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin
881,250,No,2,male,54.0,1,0,26.0000,NaN
882,418,Yes,2,female,18.0,0,2,13.0000,NaN
883,478,No,3,male,29.0,1,0,7.0458,NaN
884,509,No,3,male,28.0,0,0,22.5250,NaN
885,187,Yes,3,female,NaN,1,0,15.5000,NaN
886,779,No,3,male,NaN,0,0,7.7375,NaN
887,435,No,1,male,50.0,1,0,55.9000,E44
888,342,Yes,1,female,24.0,3,2,263.0000,C23 C25 C27
889,633,Yes,1,male,32.0,0,0,30.5000,B50
890,111,No,1,male,47.0,0,0,52.0000,C110

### staties

In [45]:
CSV_1.describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean    446.000000    2.308642   29.699118    0.523008    0.381594   32.204208
std     257.353842    0.836071   14.526497    1.102743    0.806057   49.693429
min       1.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%     223.500000    2.000000   20.125000    0.000000    0.000000    7.910400
50%     446.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%     668.500000    3.000000   38.000000    1.000000    0.000000   31.000000
max     891.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [ ]:
# Remote CSV
CSV_2 = pd.read_csv('data.csv')
CSV_2

In [ ]:
CSV_2.dtypes

In [ ]:
CSV_2.head(15)

In [ ]:
CSV_2.tail(15)

### Reading data from  Excel

In [ ]:
# local Execl
Excel_1 =  pd.read_excel('employees.xlsx',sheet_name="Sheet1")
Excel_1.info()

In [ ]:
Excel_1.dtypes

In [ ]:
Excel_1.head(10)

In [ ]:
Excel_1.tail(10)

In [ ]:
# Remote Excel
Excel_1 =  pd.read_excel('https://view.officeapps.live.com/op/view.aspx?src=https%3A%2F%2Fs3.us-east-1.amazonaws.com%2Fhdx-production-filestore%2Fresources%2F946f7939-75cd-45c0-a67a-63c68808730e%2Fsm_us6000jllz_pop_estimation.xlsx%3FAWSAccessKeyId%3DAKIAXYC32WNAS5V67V55%26Signature%3DHX2HbNVQhUrW2%252FwTvBmChRbOG1M%253D%26Expires%3D1688926317&wdOrigin=BROWSELINK')
Excel_1.info()

### Reading data from HTML Website

In [ ]:
## Remote HTML Website
HTML_1 = pd.read_html('https://hoopshype.com/salaries/players/')
HTML_1

### Reading data from DataBase SQL

In [ ]:
left_table = pd.DataFrame(
  data = {
      'ID':[1,2,3,4],
      'VALUE':['LEFT 1','LEFT 2','LEFT 3','LEFT 4']
  }
)

right_table = pd.DataFrame(
  data = {
      'ID':[1,4,5,6],
      'VALUE':['RIGHT 1','RIGHT 2','RIGHT 3','RIGHT 4']
  }
)

In [ ]:
## Inner join
left_table.merge( right_table , left_on ='ID'  , right_on = 'ID', suffixes = ('_LEFT','_RIGHT'))

In [ ]:
## Self join
left_table.merge( left_table , left_on ='ID'  , right_on = 'ID', suffixes = ('_LEFT','_LEFT2'))

In [ ]:
## Left join
left_table.merge( right_table , how ='left' , on ='ID', suffixes = ('_LEFT','_RIGHT'))

In [ ]:
## Right join
left_table.merge( right_table , how ='right' , on ='ID', suffixes = ('_LEFT','_RIGHT'))

In [ ]:
## Full join
left_table.merge( right_table , how ='outer' , suffixes = ('_LEFT','_RIGHT'))

In [ ]:
## Cross join
left_table.merge( right_table , how ='cross', suffixes = ('_LEFT','_RIGHT'))

In [ ]:
left_table = pd.DataFrame(
  data = {
      'ID':[1,7,3,8,9],
      'VALUE':['VALUE 1','VALUE 7','VALUE 3','VALUE 8','VALUE 9']
  }
)

right_table = pd.DataFrame(
  data = {
      'ID':[1,8,2,10,9],
      'VALUE':['VALUE 1','VALUE 8','VALUE 2','VALUE 10','VALUE 9']
  }
)

In [ ]:
## UNION ALL
pd.concat([right_table,left_table] , ignore_index=True)

In [ ]:
## UNION
pd.concat([right_table,left_table] , ignore_index=True).drop_duplicates()

### Boolean Indexing

In [ ]:
CSV_1.Sex == 'male'

In [ ]:
CSV_1[CSV_1.Sex == 'male']

In [ ]:
CSV_1.Survived == 'Yes'

In [ ]:
CSV_1[CSV_1.Survived == 'Yes']

In [ ]:
np.logical_and(CSV_1.Sex == 'male',CSV_1.Survived == 'Yes')

In [ ]:
CSV_1[np.logical_and(CSV_1.Sex == 'male',CSV_1.Survived == 'Yes')]

In [ ]:
CSV_1['Sex'] == 'male'

In [ ]:
CSV_1[CSV_1['Sex'] == 'male']

In [ ]:
CSV_1['Survived'] == 'Yes'

In [ ]:
CSV_1[CSV_1['Survived'] == 'Yes']

In [ ]:
np.logical_and(CSV_1['Sex'] == 'male',CSV_1['Survived'] == 'Yes')

In [ ]:
CSV_1[np.logical_and(CSV_1['Sex'] == 'male',CSV_1['Survived'] == 'Yes')]

In [ ]:
CSV_2.country == 'Sweden'

In [ ]:
CSV_2[CSV_2.country == 'Sweden']

In [ ]:
CSV_2.population >= 1291589

In [ ]:
CSV_2[CSV_2.population >= 1291589]

In [ ]:
np.logical_and(CSV_2.country == 'Sweden',CSV_2.population >= 1291589)

In [ ]:
CSV_2[np.logical_and(CSV_2.country == 'Sweden',CSV_2.population >= 1291589)]

In [ ]:
CSV_2['population'] >= 1291589

In [ ]:
CSV_2[CSV_2['population'] >= 1291589]

In [ ]:
CSV_2['country'] == 'Sweden'

In [ ]:
CSV_2[CSV_2['country'] == 'Sweden']

In [ ]:
np.logical_and(CSV_2.country == 'Sweden',CSV_2.population >= 1291589)

In [ ]:
CSV_2[np.logical_and(CSV_2.country == 'Sweden',CSV_2.population >= 1291589)]

In [ ]:
Excel_1.YearsOfService >= 4

In [ ]:
Excel_1[Excel_1.YearsOfService >= 4]

In [ ]:
Excel_1.Grade == 'a'

In [ ]:
Excel_1[Excel_1.Grade == 'a']

In [ ]:
np.logical_and(Excel_1.YearsOfService >= 4 , Excel_1.Grade == 'a')

In [ ]:
Excel_1[np.logical_and(Excel_1.YearsOfService >= 4 , Excel_1.Grade == 'a')]

In [ ]:
 Excel_1['YearsOfService'] >= 4

In [ ]:
Excel_1[Excel_1['YearsOfService'] >= 4]

In [ ]:
Excel_1['Grade'] == 'a'

In [ ]:
Excel_1[Excel_1['Grade'] == 'a']

In [ ]:
np.logical_and(Excel_1['YearsOfService'] >= 4 , Excel_1['Grade'] == 'a')

In [ ]:
Excel_1[np.logical_and(Excel_1['YearsOfService'] >= 4 , Excel_1['Grade'] == 'a')]

In [ ]:
Excel_1.pop('Age')

In [ ]:
Excel_1.pop('Grade')
Excel_1

In [ ]:
del Excel_1['Department']
Excel_1

### Handle Missing Values

In [ ]:
df = pd.read_csv('surveys.csv')
df.head()

In [ ]:
df.info()

any : If any NA values are present, drop that row or column.

all : If all values are NA, drop that row or column.

thresh : Require that many non-NA values. Cannot be combined with how.

In [ ]:
df_2 = df.dropna(how='any')
df_2.head()

In [ ]:
df_2.info()

In [ ]:
df_3 = df.dropna(how='all', subset=['weight', 'hindfoot_length'])
df_3.head()

In [ ]:
df_3.info()

In [ ]:
df_4 = df.dropna(thresh=6)
df_4.head()

In [ ]:
df_4.info()

In [ ]:
df_5 = df.dropna(thresh=2, subset=['weight', 'hindfoot_length'])
df_5.head()

In [ ]:
df_5.info()

In [ ]:
df = df.fillna(value='0')
df

In [ ]:
fill_value = {"weight": 0, "hindfoot_length": df['hindfoot_length'].mean(), "sex": df['sex'].mode().iloc[0], "species_id": df['species_id'].mode().iloc[0]}
df_1 = df.fillna(value=fill_value,inplace=True)
df

In [ ]:
fill_value = {"weight": 0, "hindfoot_length": df['hindfoot_length'].mean(), "sex": df['sex'].mode().iloc[0], "species_id": df['species_id'].mode().iloc[0]}
df_1 = df.fillna(value=fill_value)
df_1

In [ ]:
df = pd.DataFrame(np.array(([1, 2, 3], [4, 5, 6])),
                  index=['mouse', 'rabbit'],
                  columns=['one', 'two', 'three'])
df

In [ ]:
# select columns by name
df.filter(items=['one', 'three'])

In [ ]:
df.filter(like='mouse',axis=0)

In [ ]:
df =  pd.DataFrame({
    'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
    'col2': [2, 1, 9, 8, 7, 4],
    'col3': [0, 1, 9, 4, 2, 3],
    'col4': ['a', 'B', 'c', 'D', 'e', 'F']
})
df.sort_index(ascending=False)

In [ ]:
df.sort_values(by=['col1'])

In [ ]:
df.sort_values(by=['col1', 'col2'])

In [ ]:
df.sort_values(by='col1', ascending=False)

In [ ]:
## drop---> remove elements using drop
df = pd.DataFrame(np.arange(12).reshape(3, 4), columns=['A', 'B', 'C', 'D'])
df

In [ ]:
df.drop('A', axis=1)

In [ ]:
df.drop([0,2], axis=0)

In [ ]:
df.drop(['C','D'] , axis=1)

### Handle Duplicated Rows

Return boolean Series denoting duplicate rows

In [ ]:
# duplicated
df = pd.DataFrame({
    'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
    'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
    'rating': [4, 4, 3.5, 15, 5]
})
df

In [ ]:
df.duplicated()

In [ ]:
df[df.duplicated()]

In [ ]:
df.duplicated(keep='last')

In [ ]:
df[df.duplicated(keep='last')]

In [ ]:
df.duplicated(subset=['brand'])

In [ ]:
df[df.duplicated(subset=['brand'])]

In [ ]:
df = df.drop_duplicates(subset=['brand'], ignore_index = True, keep='last')
df

### Drop_duplicates

Return DataFrame with duplicate rows removed

In [ ]:
df.drop_duplicates(subset=['brand'])

In [ ]:
df.drop_duplicates(subset=['brand', 'style'], keep='last')

### Get_dummies

Convert categorical variable into dummy/indicator variables.

Each variable is converted in as many 0/1 variables as there are different values. Columns in the output are each named after a value; if the input is a DataFrame, the name of the original variable is prepended to the value.

In [ ]:
df = pd.read_csv('surveys.csv')
df.info()

In [ ]:
df

In [ ]:
pd.get_dummies(df['sex'])

In [ ]:
pd.get_dummies(df[['sex', 'year']])

### Concat

Concatenate pandas objects along a particular axis.

In [ ]:
s1 = pd.Series(['a', 'b'])
s2 = pd.Series(['c', 'd'])
pd.concat([s1, s2])

In [ ]:
pd.concat([s1, s2], ignore_index=True)

In [ ]:
pd.concat([s1, s2], keys=['s1', 's2'],
          names=['Series name', 'Row ID'])

In [ ]:
df1 = pd.DataFrame([['a', 1], ['b', 2]],
                   columns=['letter', 'number'])
df1

In [ ]:
df2 = pd.DataFrame([['c', 3], ['d', 4]],
                   columns=['letter', 'number'])
df2

In [ ]:
df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
                   columns=['letter', 'number', 'animal'])
df3

In [ ]:
pd.concat([df1, df2], sort=False,ignore_index=True)

In [ ]:
pd.concat([df1, df3], sort=False,ignore_index=True)

In [ ]:
pd.concat([df2, df3], sort=False,ignore_index=True)

### Replace

Values of the DataFrame are replaced with other values dynamically

In [ ]:
df = pd.DataFrame({ 
                    "Name": ["Ahmed", "Mahmoud", "Moustafa", "Mohamed", "Yassin", "Abd el Rahman", "Emam", "Nabil", "Saad"],   
                    "Score": ["Low", "Low", "Medium", "Medium", "High", "Low", "Medium","High", "Low"],
                    "Age": [33, 34, 27, 3, 1, 32, 34, 36, 33]
                })
df

In [ ]:
ordinal_encoding_mapping = {"Low":1, "Medium":2, "High":3}
df["Score"] = df["Score"].replace(ordinal_encoding_mapping)
df

In [ ]:
df.info()

In [ ]:
df['Score'].astype('S')

In [ ]:
df.info()

### Normalization

DataFrame in pandas where each column has different value range

In [ ]:
df = pd.read_csv('surveys1.csv', index_col=0)
df

In [ ]:
normalized_df=(df-df.min())/(df.max()-df.min())
normalized_df

### Discretization

In [ ]:
df = pd.read_csv('surveys1.csv', index_col=0)
df

In [ ]:
pd.get_dummies(
    pd.cut(df['weight'], 8, 
       labels=['weight_range1', 'weight_range2', 'weight_range3', 'weight_range4', 
               'weight_range5', 'weight_range6', 'weight_range7', 'weight_range8'])
)

### Grouping


one or more of the following steps:

Splitting the data into groups based on some criteria

Applying a function to each group independently

Combining the results into a data structure

In [ ]:
df = pd.read_excel('employees.xlsx', 'Sheet1')
df

In [ ]:
df.groupby('Department')

In [ ]:
df.groupby('Department').sum()

In [ ]:
df.groupby('YearsOfService').sum()

In [ ]:
df.groupby('YearsOfService').count()

In [ ]:
employees_df.groupby('Grade')['Age'].max()